; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 7903)
	(= (fuel plane1) 2253)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 9)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at plane2 city3)
	(= (capacity plane2) 2619)
	(= (fuel plane2) 849)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 7)
	(at plane3 city2)
	(= (capacity plane3) 11472)
	(= (fuel plane3) 336)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 14)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 5)
	(at person1 city4)
	(at person2 city1)
	(at person3 city0)
	(at person4 city4)
	(at person5 city4)
	(at person6 city2)
	(at person7 city0)
	(at person8 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 676)
	(= (distance city0 city2) 894)
	(= (distance city0 city3) 952)
	(= (distance city0 city4) 521)
	(= (distance city0 city5) 977)
	(= (distance city1 city0) 676)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 624)
	(= (distance city1 city3) 933)
	(= (distance city1 city4) 919)
	(= (distance city1 city5) 961)
	(= (distance city2 city0) 894)
	(= (distance city2 city1) 624)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 826)
	(= (distance city2 city4) 775)
	(= (distance city2 city5) 634)
	(= (distance city3 city0) 952)
	(= (distance city3 city1) 933)
	(= (distance city3 city2) 826)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 841)
	(= (distance city3 city5) 691)
	(= (distance city4 city0) 521)
	(= (distance city4 city1) 919)
	(= (distance city4 city2) 775)
	(= (distance city4 city3) 841)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 950)
	(= (distance city5 city0) 977)
	(= (distance city5 city1) 961)
	(= (distance city5 city2) 634)
	(= (distance city5 city3) 691)
	(= (distance city5 city4) 950)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city2)
	(at person2 city1)
	(at person3 city3)
	(at person4 city3)
	(at person5 city2)
	(at person6 city1)
	(at person7 city1)
	(at person8 city0)
	))

(:metric minimize (+ (* 2 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (refuel plane2 city3)
   changed: (fuel plane2) from 849 to 2619
   goals met: 1 of 8
2. (board person8 plane2 city3)
   deleted: (at person8 city3)
   added: (in person8 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 8
3. (fly plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 0 to 826, (fuel plane2) from 2619 to 1793
   goals met: 1 of 8
4. (board person6 plane2 city2)
   deleted: (at person6 city2)
   added: (in person6 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 1 of 8
5. (fly plane2 city2 city4)
   deleted: (at plane2 city2)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 826 to 1601, (fuel plane2) from 1793 to 1018
   goals met: 1 of 8
6. (board person1 plane2 city4)
   deleted: (at person1 city4)
   added: (in person1 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 1 of 8
7. (board person4 plane2 city4)
   deleted: (at person4 city4)
   added: (in person4 plane2)
   changed: (onboard plane2) from 3 to 4
   goals met: 1 of 8
8. (board person5 plane2 city4)
   deleted: (at person5 city4)
   added: (in person5 plane2)
   changed: (onboard plane2) from 4 to 5
   goals met: 1 of 8
9. (fly plane2 city4 city0)
   deleted: (at plane2 city4)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 1601 to 2122, (fuel plane2) from 1018 to 497
   goals met: 1 of 8
10. (debark person8 plane2 city0)
   deleted: (in person8 plane2)
   added: (at person8 city0)
   changed: (onboard plane2) from 5 to 4
   goals met: 2 of 8
11. (board person3 plane2 city0)
   deleted: (at person3 city0)
   added: (in person3 plane2)
   changed: (onboard plane2) from 4 to 5
   goals met: 2 of 8
12. (board person7 plane2 city0)
   deleted: (at person7 city0)
   added: (in person7 plane2)
   changed: (onboard plane2) from 5 to 6
   goals met: 2 of 8
13. (refuel plane2 city0)
   changed: (fuel plane2) from 497 to 2619
   goals met: 2 of 8
14. (fly plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 2122 to 3016, (fuel plane2) from 2619 to 1725
   goals met: 2 of 8
15. (debark person1 plane2 city2)
   deleted: (in person1 plane2)
   added: (at person1 city2)
   changed: (onboard plane2) from 6 to 5
   goals met: 3 of 8
16. (debark person5 plane2 city2)
   deleted: (in person5 plane2)
   added: (at person5 city2)
   changed: (onboard plane2) from 5 to 4
   goals met: 4 of 8
17. (fly plane2 city2 city1)
   deleted: (at plane2 city2)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 3016 to 3640, (fuel plane2) from 1725 to 1101
   goals met: 4 of 8
18. (debark person6 plane2 city1)
   deleted: (in person6 plane2)
   added: (at person6 city1)
   changed: (onboard plane2) from 4 to 3
   goals met: 5 of 8
19. (debark person7 plane2 city1)
   deleted: (in person7 plane2)
   added: (at person7 city1)
   changed: (onboard plane2) from 3 to 2
   goals met: 6 of 8
20. (fly plane2 city1 city3)
   deleted: (at plane2 city1)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 3640 to 4573, (fuel plane2) from 1101 to 168
   goals met: 6 of 8
21. (debark person3 plane2 city3)
   deleted: (in person3 plane2)
   added: (at person3 city3)
   changed: (onboard plane2) from 2 to 1
   goals met: 7 of 8
22. (debark person4 plane2 city3)
   deleted: (in person4 plane2)
   added: (at person4 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 8 of 8
